# =============================================================================
# Brewfile.cask - GUI Applications (macOS)
# =============================================================================

# -----------------------------------------------------------------------------
# Terminals
# -----------------------------------------------------------------------------
cask "ghostty"
cask "warp"
cask "iterm2"

# -----------------------------------------------------------------------------
# Editors & IDEs
# -----------------------------------------------------------------------------
cask "visual-studio-code"
cask "zed"

# -----------------------------------------------------------------------------
# Browsers
# -----------------------------------------------------------------------------
cask "google-chrome"

# -----------------------------------------------------------------------------
# Productivity
# -----------------------------------------------------------------------------
cask "raycast"
cask "cleanmymac"
cask "cleanshot"
cask "copyclip"
cask "pdf-squeezer"
cask "imageoptim"
cask "the-unarchiver"
cask "betterzip"

# -----------------------------------------------------------------------------
# System Utilities
# -----------------------------------------------------------------------------
cask "karabiner-elements"
cask "jordanbaird-ice"
cask "aldente"
cask "topnotch"
cask "little-snitch"

# -----------------------------------------------------------------------------
# Development
# -----------------------------------------------------------------------------
cask "github"
cask "devutils"
cask "1password-cli"

# -----------------------------------------------------------------------------
# AI Tools
# -----------------------------------------------------------------------------
cask "claude-code"

# -----------------------------------------------------------------------------
# Design
# -----------------------------------------------------------------------------
cask "colorsnapper"
cask "sketch"

# -----------------------------------------------------------------------------
# Media
# -----------------------------------------------------------------------------
cask "vlc"

# -----------------------------------------------------------------------------
# Cloud & Sync
# -----------------------------------------------------------------------------
cask "dropbox"

# -----------------------------------------------------------------------------
# Communication
# -----------------------------------------------------------------------------
cask "zoom"

# -----------------------------------------------------------------------------
# Backup
# -----------------------------------------------------------------------------
cask "carbon-copy-cloner"

# -----------------------------------------------------------------------------
# Fonts
# -----------------------------------------------------------------------------
cask "font-meslo-lg-nerd-font"
cask "font-victor-mono"
cask "font-roboto-mono-for-powerline"

# -----------------------------------------------------------------------------
# Optional: LaTeX (large ~4GB)
# -----------------------------------------------------------------------------
cask "mactex"
