# Core CLI Tools
brew "git"
brew "chezmoi"
brew "starship"
brew "zsh"
brew "jq"
brew "ripgrep"
brew "eza"
brew "bat"
brew "fzf"
brew "zoxide"
brew "go"
brew "neovim"
brew "lua"
brew "luajit"
brew "luarocks"
brew "luacheck"
brew "stylua"
brew "lazygit"
brew "delta"
brew "tlrc"
brew "dust"
brew "duf"
brew "gping"
brew "procs"
brew "bottom"
brew "hyperfine"
brew "age"
brew "gnupg"
brew "hexyl"
brew "yq"
brew "gum"
brew "glow"
brew "gh"
brew "glab"
brew "mas"
brew "duti"
brew "fastfetch"
brew "ollama"
brew "fabric-ai"
brew "uv"
brew "terraform"
brew "terraform-docs"
brew "tflint"
brew "trivy"
brew "checkov"
brew "ansible"
brew "ansible-lint"

# Update & runtime tooling
brew "topgrade"
brew "mise"
brew "fnm"
brew "python@3.12"
brew "rustup"
brew "tmux"
brew "pipx"
brew "ruby"
brew "yazi"

# AI CLI Tools
brew "aichat"
brew "mods"

# Kubernetes
brew "kubectl"
brew "kubectx"
brew "stern"
brew "kube-linter"
brew "kubeseal"
brew "minikube"
brew "k9s"
brew "helm"
