# =============================================================================
# Brewfile.cli - Core CLI Tools (Cross-Platform)
# Optimized for performance and development workflows
# =============================================================================

# -----------------------------------------------------------------------------
# Core Utilities
# -----------------------------------------------------------------------------
brew "git"
brew "chezmoi"
brew "jq"
brew "yq"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "bat"
brew "eza"
brew "dust"
brew "duf"
brew "tree"
brew "trash"
brew "rename"

# -----------------------------------------------------------------------------
# Shell & Prompt
# -----------------------------------------------------------------------------
brew "zsh"
brew "starship"
brew "zoxide"
brew "atuin"
brew "direnv"

# -----------------------------------------------------------------------------
# Development
# -----------------------------------------------------------------------------
brew "neovim"
brew "vim"
brew "tmux"
brew "lazygit"
brew "git-delta"
brew "gh"
brew "glab"
brew "shellcheck"
brew "shfmt"

# -----------------------------------------------------------------------------
# Languages & Runtimes (managed by mise)
# -----------------------------------------------------------------------------
brew "mise"
brew "uv"                    # Fast Python package manager
brew "rustup"
brew "go"

# -----------------------------------------------------------------------------
# Lua (for Neovim)
# -----------------------------------------------------------------------------
brew "lua"
brew "luajit"
brew "luarocks"
brew "stylua"

# -----------------------------------------------------------------------------
# System Monitoring
# -----------------------------------------------------------------------------
brew "btop"
brew "procs"
brew "gping"
brew "hyperfine"
brew "fastfetch"

# -----------------------------------------------------------------------------
# Security & Encryption
# -----------------------------------------------------------------------------
brew "age"
brew "gnupg"
brew "pinentry-mac"
brew "git-crypt"
brew "mkcert"
brew "lynis"

# -----------------------------------------------------------------------------
# AI & LLM Tools
# -----------------------------------------------------------------------------
brew "ollama"
brew "aichat"
brew "mods"
brew "fabric-ai"

# -----------------------------------------------------------------------------
# File & Text Processing
# -----------------------------------------------------------------------------
brew "hexyl"
brew "glow"
brew "gum"
brew "tlrc"
brew "imagemagick"
brew "ffmpeg"

# -----------------------------------------------------------------------------
# Networking
# -----------------------------------------------------------------------------
brew "curl"
brew "wget"
brew "httpie"
brew "mtr"

# -----------------------------------------------------------------------------
# macOS Specific
# -----------------------------------------------------------------------------
brew "mas"
brew "duti"
brew "topgrade"

# -----------------------------------------------------------------------------
# Archive & Compression
# -----------------------------------------------------------------------------
brew "p7zip"
brew "unar"
brew "sevenzip"
