# Core CLI Tools
brew "git"
brew "chezmoi"
brew "starship"
brew "zsh"
brew "jq"
brew "ripgrep"
brew "eza"
brew "bat"
brew "fzf"
brew "zoxide"
brew "go"
brew "neovim"
brew "lazygit"
brew "delta"
brew "tldr"
brew "dust"
brew "duf"
brew "gping"
brew "procs"
brew "bottom"
brew "hyperfine"
brew "age"
brew "hexyl"
brew "yq"
brew "gum"
brew "glow"
brew "gh"
brew "glab"
brew "mas"
brew "duti"
brew "fastfetch"
brew "ollama"
brew "fabric-cli"
brew "uv"
